marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
#if (ADC_SET_MODE_API == STD_ON)
/**
* @brief      This function validates the Adc_SetMode call.
* @details    This function validates the Adc_SetMode call.
*
* @param[in]  u8ServiceId   The service id of the caller function
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The Adc_SetMode call is valid
* @retval     E_NOT_OK:       The Adc_SetMode call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateSetMode
(
    VAR(Adc_SetModeType, AUTOMATIC) eSetMode
)
{
    VAR(Std_ReturnType, AUTOMATIC) SleepModeStatus = (Std_ReturnType)E_OK;

    if(NULL_PTR == Adc_pCfgPtr)
    {
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        /* Report error to DET */
        Adc_ReportDetError((uint8)ADC_SETMODE_ID, (uint8)ADC_E_UNINIT);
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
        SleepModeStatus = (Std_ReturnType)E_NOT_OK;
    }
    else
    {
        if ((ADC_NORMAL_MODE != eSetMode) && (ADC_POWER_DOWN_MODE != eSetMode))
        {
            SleepModeStatus = (Std_ReturnType)E_NOT_OK;
            #if (ADC_DEV_ERROR_DETECT == STD_ON)
            Adc_ReportDetError((uint8)ADC_SETMODE_ID, (uint8)ADC_E_SET_MODE);
            #endif
        }
    }
    return SleepModeStatus;
}
#endif /* ADC_SET_MODE_API == STD_ON */


#if (ADC_VALIDATE_GLOBAL_CALL == STD_ON)
/**
* @brief        This function ends the validation of the global call parameters.
* @details      This service is a non reentrant function used for end the validation the calls
*               for functions like Adc_Init, Adc_DeInit.
*
* @param[in]    ValidCall validity of the call
* @param[in]    u8ServiceId The service id of the caller function
*
* @return void
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_EndValidateGloballCall
(
    VAR(Std_ReturnType, AUTOMATIC) ValidCall,
    VAR(uint8, AUTOMATIC) u8ServiceId
)
{
    if ((Std_ReturnType)E_OK == ValidCall)
    {
        if (ADC_DEINIT_ID == u8ServiceId)
        {
            Adc_GlobalState = ADC_STATE_UNINIT;
        }
        else
        {
            Adc_GlobalState = ADC_STATE_IDLE;
        }
    }
}
#endif /* ADC_VALIDATE_GLOBAL_CALL == STD_ON */

#if ((ADC_VALIDATE_STATE == STD_ON) && (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) && ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || defined(__DOXYGEN__)))
/**
* @brief        This function validates the state of a group when priorities are used.
* @details      This service is a non reentrant function used for validating the state of a group
*                when priorities are used
*
* @param[in]    Group         The group id
* @param[in]    bImplicitly    Indicates if the group can be implicitly stopped
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateNotBusyWithPrio
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(boolean, AUTOMATIC) bImplicitly
)
{
    VAR(boolean, AUTOMATIC) bFlag = (boolean)FALSE;
    VAR(Adc_QueueIndexType, AUTOMATIC) Index = 0U;
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
    VAR(Adc_QueueIndexType, AUTOMATIC) SwNormalQueueIndex;
    VAR(Adc_StatusType, AUTOMATIC) eConversion;

    if (Adc_aUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0)
    {
        for (Index = 0U; Index < Adc_aUnitStatus[Unit].SwNormalQueueIndex; Index++)
        {
            if (Group == Adc_aUnitStatus[Unit].SwNormalQueue[Index])
            {
                bFlag = (boolean)TRUE;
            }
        }
    }
    SwNormalQueueIndex = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    eConversion = Adc_aGroupStatus[Group].eConversion;
    if ((((Group == Adc_aUnitStatus[Unit].SwNormalQueue[0]) && (SwNormalQueueIndex > (Adc_QueueIndexType)0)) || ((boolean)TRUE == bFlag)) && \
        ((boolean)FALSE == bImplicitly) \
       )
    {
        Adc_ReportDetError((uint8)ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
    else if (((eConversion != ADC_IDLE) && (eConversion != ADC_STREAM_COMPLETED)) && \
             ((boolean)TRUE == bImplicitly) \
            )
    {
        Adc_ReportDetError((uint8)ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
    else
    {
        ValidState = (Std_ReturnType)E_OK;
    }
    return ValidState;
}
#endif /* (ADC_VALIDATE_STATE == STD_ON) && (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) && ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || defined(__DOXYGEN__)) */

#if (((ADC_VALIDATE_STATE == STD_ON) && (ADC_HW_TRIGGER_API == STD_ON) && (ADC_ENABLE_QUEUING == STD_OFF)) \
      || (((ADC_VALIDATE_STATE == STD_ON) && ((ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__)))         \
      || (ADC_CALIBRATION == STD_ON) || (ADC_DUAL_CLOCK_MODE == STD_ON)  || (ADC_SET_MODE_API == STD_ON)   \
         ) \
    )
/**
* @brief        This function validates the state of a group when the queue is not used.
* @details      This service is a non reentrant function used for validating the state of a group
*                when the queue is not used
*
* @param[in]    Unit          The hardware unit
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call means that unit is not busy
* @retval     E_NOT_OK:       The call means that unit is busy
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateNotBusyNoQueue
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(uint8, AUTOMATIC) u8ServiceId
)
{
    VAR(Std_ReturnType, AUTOMATIC) ErrorFound = (Std_ReturnType)E_OK;
#if (ADC_HW_TRIGGER_API == STD_ON)
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInHwInjectedQueue;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInHwNormalQueue;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwNormalQueue;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwInjectedQueue;

