marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
    /* Enter critical section to protect against queue modifications */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_20();
    /* Get HW and SW queue sizes */
    NoGroupsInSwNormalQueue = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    NoGroupsInSwInjectedQueue = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;
#if (ADC_HW_TRIGGER_API == STD_ON)
    NoGroupsInHwInjectedQueue = Adc_aUnitStatus[Unit].HwInjectedQueueIndex;
    NoGroupsInHwNormalQueue = Adc_aUnitStatus[Unit].HwNormalQueueIndex;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_20();
    /* Check for ongoing conversions */
    if ((NoGroupsInSwNormalQueue > (Adc_QueueIndexType)0)
        || (NoGroupsInSwInjectedQueue > (Adc_QueueIndexType)0)
#if (ADC_HW_TRIGGER_API == STD_ON)
        || (NoGroupsInHwInjectedQueue > (Adc_QueueIndexType)0)
        || (NoGroupsInHwNormalQueue > (Adc_QueueIndexType)0)
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
       )   
    {
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_BUSY);
#else
        /* Avoid compiler warning */
        (void)u8ServiceId;
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
        ErrorFound = (Std_ReturnType)E_NOT_OK;
    }
    return ErrorFound;
}
#endif /* ... */

#if ((ADC_HW_TRIGGER_API == STD_ON) && (ADC_VALIDATE_STATE == STD_ON))
/**
* @brief        This function validates the state of a group when the hardware trigger is enabled.
* @details      This service is a non reentrant function used for validating the state of a group
*                when the hardware trigger is enabled.
*
 @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateNotBusyEnableHwTrig
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
#if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_OFF)
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwNormalQueue = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwInjectedQueue = 0U;
    VAR(Adc_GroupConvType, AUTOMATIC) GroupType = ADC_CONV_TYPE_NORMAL;
    VAR(Adc_HwTriggeringType, AUTOMATIC) eHwTriggering;
#endif /* ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_OFF */
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInHwNormalQueue = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInHwInjectedQueue = 0U;
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic shall be the only allowed form of pointer arithmetic */    
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;

    /* Get HW and SW queue sizes */
#if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_OFF)
    NoGroupsInSwNormalQueue = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    NoGroupsInSwInjectedQueue = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;
    /** @violates @ref Adc_c_REF_4 Array indexing */
    GroupType = Adc_pCfgPtr->pGroups[Group].eType;
#endif /* ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON */
    NoGroupsInHwInjectedQueue = Adc_aUnitStatus[Unit].HwInjectedQueueIndex;
    NoGroupsInHwNormalQueue = Adc_aUnitStatus[Unit].HwNormalQueueIndex;

#if (ADC_ENABLE_QUEUING == STD_OFF)
    if ((Std_ReturnType)E_OK == Adc_ValidateNotBusyNoQueue(Unit, ADC_ENABLEHARDWARETRIGGER_ID))
#endif /* ADC_ENABLE_QUEUING == STD_OFF  */
    {
#if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON)
        /* The queue is not empty, check the type of the group that will be (or not) en-queued */
        /* Different group type or more than one regular group not allowed */
        /** @violates @ref Adc_c_REF_4 Array indexing */
        if (((0U != NoGroupsInHwInjectedQueue) || (0U != NoGroupsInHwNormalQueue)) && \
            ((Adc_aUnitStatus[Unit].HwQueueGroupType != Adc_pCfgPtr->pGroups[Group].IsMHTGroup) || \
             ((Adc_MhtGroupType)ADC_REGULAR_GROUP_TYPE == Adc_aUnitStatus[Unit].HwQueueGroupType)
            )
           )
        {
            Adc_ReportDetError((uint8)ADC_ENABLEHARDWARETRIGGER_ID, (uint8)ADC_E_BUSY);
        }

        else if ((ADC_HWTRIGGER_ENABLED == Adc_aGroupStatus[Group].eHwTriggering) ||
                 ((uint8)ADC_HW_QUEUE <= NoGroupsInHwInjectedQueue) ||
                 ((uint8)ADC_HW_QUEUE <= NoGroupsInHwNormalQueue)
                )
#else
        eHwTriggering = Adc_aGroupStatus[Group].eHwTriggering;
        /** @violates @ref Adc_c_REF_4 Array indexing */
        if (((ADC_HWTRIGGER_ENABLED == eHwTriggering) && ((0U != NoGroupsInHwInjectedQueue) || (0U != NoGroupsInHwNormalQueue))) || \
            ((ADC_CONV_TYPE_INJECTED == GroupType) && ((0U != NoGroupsInSwInjectedQueue) || (0U != NoGroupsInHwNormalQueue))) || \
            ((ADC_CONV_TYPE_NORMAL == GroupType) && ((0U != NoGroupsInHwInjectedQueue) || (0U != NoGroupsInSwNormalQueue) )) \
           )

#endif /* ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON */
        {
            Adc_ReportDetError((uint8)ADC_ENABLEHARDWARETRIGGER_ID, (uint8)ADC_E_BUSY);
        }
        else
        {
            ValidState = (Std_ReturnType)E_OK;
        }
    }
    return ValidState;
}
#endif /* (ADC_HW_TRIGGER_API == STD_ON).. */

#if ((ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) && (ADC_VALIDATE_STATE == STD_ON))
/**
* @brief        This function validates the state of a group when the ctu trigger is enabled.
* @details      This service is a non reentrant function used for validating the state of a group
*                when the ctu trigger is enabled.
*
 @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateNotBusyEnableCtuTrig
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
    VAR(Adc_GroupType, AUTOMATIC) GroupInQueue;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
#if (ADC_ENABLE_QUEUING == STD_OFF)
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwNormalQueue = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwInjectedQueue = 0U;
#endif /* ADC_ENABLE_QUEUING == STD_OFF */

#if (ADC_ENABLE_QUEUING == STD_OFF)
    /* Enter critical section to protect against queue modifications */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_20();
    /* Get HW and SW queue sizes */
    NoGroupsInSwNormalQueue = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    NoGroupsInSwInjectedQueue = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_20();
    /* Check for ongoing conversions */
    if ((0U != NoGroupsInSwNormalQueue) || (0U != NoGroupsInSwInjectedQueue))
    {
       Adc_ReportDetError((uint8)ADC_ENABLECTUTRIGGER_ID, (uint8)ADC_E_BUSY);
    }
    else
#endif /* ADC_ENABLE_QUEUING == STD_OFF */
    {
        if (0U != Adc_aUnitStatus[Unit].HwInjectedQueueIndex)
        {
            GroupInQueue = Adc_aUnitStatus[Unit].HwInjectedQueue[0];
            if ((Group != GroupInQueue) || (ADC_HWTRIGGER_ENABLED == Adc_aGroupStatus[GroupInQueue].eHwTriggering))
            {
                Adc_ReportDetError((uint8)ADC_ENABLECTUTRIGGER_ID, (uint8)ADC_E_BUSY);
            }
            else
            {
                ValidState = (Std_ReturnType)E_OK;
            }
        }
        else
        {
            ValidState = (Std_ReturnType)E_OK;
        }
    }
    return ValidState;
}
#endif /* (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) && (ADC_VALIDATE_STATE == STD_ON) */

#if ((ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE) && (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) && (ADC_VALIDATE_STATE == STD_ON))
/**
* @brief        This function validates the state of a group when priorities are not used.
* @details      This service is a non reentrant function used for validating the state of a group
*                when priorities are not used
*
* @param[in]    Unit          The hardware unit
* @param[in]    Group         The group id
* @param[in]    bImplicitly   Indicates if the group can be implicitly stopped
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE)Adc_ValidateNotBusyNoPrio
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(boolean, AUTOMATIC) bImplicitly
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
#if (ADC_ENABLE_QUEUING == STD_OFF)
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
    VAR(boolean, AUTOMATIC) bQueuesEmpty = (boolean)TRUE;
#else /* ADC_ENABLE_QUEUING == STD_ON */
    VAR(Adc_StatusType, AUTOMATIC) eConversion;
#endif

#if (ADC_ENABLE_QUEUING == STD_OFF)
    if (Adc_aUnitStatus[Unit].SwNormalQueueIndex != (Adc_QueueIndexType)0)
    {
        bQueuesEmpty = (boolean)FALSE;
    }
    if (Adc_aUnitStatus[Unit].SwInjectedQueueIndex != (Adc_QueueIndexType)0)
    {
        bQueuesEmpty = (boolean)FALSE;
    }
    #if (STD_ON==ADC_HW_TRIGGER_API)
    if (Adc_aUnitStatus[Unit].HwInjectedQueueIndex != (Adc_QueueIndexType)0)
    {
        bQueuesEmpty = (boolean)FALSE;
    }
    if (Adc_aUnitStatus[Unit].HwNormalQueueIndex != (Adc_QueueIndexType)0)
    {
        bQueuesEmpty = (boolean)FALSE;
    }
    #endif

    /* Check if any queue is non-empty*/
    if ((boolean)FALSE == bQueuesEmpty)
    {
        Adc_ReportDetError((uint8)ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
    else
    {
        ValidState = (Std_ReturnType)E_OK;
    }
    (void)bImplicitly;
    (void)Group;
#else /* ADC_ENABLE_QUEUING == STD_ON */
    eConversion = Adc_aGroupStatus[Group].eConversion;
    if (((boolean)FALSE == bImplicitly) && (ADC_IDLE != eConversion))
    {
        Adc_ReportDetError((uint8)ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
    else if (((boolean)TRUE == bImplicitly) && (ADC_IDLE != eConversion) && \
             (ADC_STREAM_COMPLETED != eConversion) \
            )
    {
        Adc_ReportDetError((uint8)ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
    else
    {
        ValidState = (Std_ReturnType)E_OK;
    }
#endif /* ADC_ENABLE_QUEUING  */
    return ValidState;
}
#endif /* (ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE)... */

#if (((ADC_VALIDATE_STATE == STD_ON) && ((ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__))) \
      || (ADC_CALIBRATION == STD_ON) || (ADC_DUAL_CLOCK_MODE == STD_ON) || (ADC_SET_MODE_API == STD_ON) \
    )
/**
* @brief        This function validates the state of all group.
* @details      This service is a non reentrant function used for validating the state of all group
*
* @param[in]    u8ServiceId     The service id of the caller function
*
* @return       Std_ReturnType  Standard return type.
* @retval       E_OK:           The call means that at leat one group is not busy
* @retval       E_NOT_OK:       The call means that at leat one group is busy
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCheckGroupNotConversion
(
    VAR(uint8, AUTOMATIC) u8ServiceId
)
{
    VAR(Adc_StatusType, AUTOMATIC) eConversion;
    VAR(Adc_GroupType,AUTOMATIC) GroupId;
    VAR(Std_ReturnType, AUTOMATIC) ErrorFound = (Std_ReturnType)E_OK;
    
