marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
    for (GroupId = 0U; GroupId < (Adc_GroupType)Adc_pCfgPtr->GroupCount; GroupId++)
    {
        eConversion = Adc_aGroupStatus[GroupId].eConversion;
        /*  Check if ADC is still converting */
        if((ADC_IDLE != eConversion) && (ADC_STREAM_COMPLETED != eConversion))
        {
#if (ADC_DEV_ERROR_DETECT == STD_ON)
            Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_BUSY);
#else
            (void)u8ServiceId;
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
            ErrorFound =  (Std_ReturnType)E_NOT_OK;
        }
    }
    return ErrorFound;    
}
#endif /* (((ADC_VALIDATE_STATE == STD_ON) ... */

#if (ADC_VALIDATE_STATE == STD_ON)
#if (ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__)
/**
* @brief        This function validates the state of a group when De-init (should not be busy).
* @details      This service is a non reentrant function used for validating the state of a group
*
* @param[in]    void
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateDeInitNotBusy(void)
{
    VAR(Std_ReturnType, AUTOMATIC) ErrorFound = (Std_ReturnType)E_OK;
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex;
    VAR(Adc_HwUnitType, AUTOMATIC) Unit;
    
    for(HwIndex = 0U; HwIndex < Adc_pCfgPtr->Misc.Adc_MaxHwCfg; HwIndex++)
    {
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Unit = Adc_pCfgPtr->pAdc[HwIndex].AdcHardwareUnitId; 
        ErrorFound = Adc_ValidateNotBusyNoQueue(Unit, ADC_DEINIT_ID);       
        if ((Std_ReturnType)E_NOT_OK == ErrorFound)
        {
            break;
        }
    } 
    if ((Std_ReturnType)E_OK == ErrorFound)
    {
        if ((Std_ReturnType)E_OK == Adc_ValidateCheckGroupNotConversion(ADC_DEINIT_ID))
        {
            ValidState = (Std_ReturnType)E_OK;
        }
    }
    
    return ValidState;
}
#endif /* (ADC_DEINIT_API == STD_ON) || defined(__DOXYGEN__) */
/**
* @brief        This function validates the state of a group when Setup result buffer (should not be busy).
* @details      This service is a non reentrant function used for validating the state of a group
*
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateSetupBufferNotBusy
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{    
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
    
    if (ADC_IDLE != Adc_aGroupStatus[Group].eConversion)
    {
        Adc_ReportDetError(ADC_SETUPRESULTBUFFER_ID, (uint8)ADC_E_BUSY);
    }
    else
    {
        ValidState = (Std_ReturnType)E_OK;
    }
    return ValidState;
}

#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || defined(__DOXYGEN__)
/**
* @brief        This function validates the state of a group when start group conversion (should not be busy).
* @details      This service is a non reentrant function used for validating the state of a group
*
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           The call is valid
* @retval     E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateStartGroupConvNotBusy
(
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{  
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_NOT_OK;
    VAR(boolean, AUTOMATIC) bImplicitly = (boolean)FALSE;
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U;
#if (STD_ON == ADC_HW_TRIGGER_API)
    VAR(Adc_GroupConvType, AUTOMATIC) eType;
    VAR(Adc_QueueIndexType, AUTOMATIC) SwInjectedQueueIndex;
    VAR(Adc_QueueIndexType, AUTOMATIC) HwInjectedQueueIndex;
    VAR(Adc_QueueIndexType, AUTOMATIC) HwNormalQueueIndex;
#endif /* #if (STD_ON==ADC_HW_TRIGGER_API) */
    
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if ((ADC_CONV_MODE_ONESHOT == Adc_pCfgPtr->pGroups[Group].eMode) || \
        ((ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode) && \
        (ADC_ACCESS_MODE_STREAMING == Adc_pCfgPtr->pGroups[Group].eAccessMode) && \
        (ADC_STREAM_BUFFER_LINEAR == Adc_pCfgPtr->pGroups[Group].eBufferMode)
        )
       )
    {
        /* The current group can be implicitly stopped */
        bImplicitly = (boolean)TRUE;
    }   
    
    /* Get the unit to which the group belongs to */
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
#if (STD_ON == ADC_HW_TRIGGER_API)
    /** @violates @ref Adc_c_REF_4 Array indexing */
    eType = Adc_pCfgPtr->pGroups[Group].eType;
    SwInjectedQueueIndex = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;
    HwInjectedQueueIndex = Adc_aUnitStatus[Unit].HwInjectedQueueIndex;
    HwNormalQueueIndex = Adc_aUnitStatus[Unit].HwNormalQueueIndex;
    
    /* SW Injected conversions should be entertained only if there are no other HW or CTU injected chains enabled*/
    /** @violates @ref Adc_c_REF_4 Array indexing */
    if((SwInjectedQueueIndex != (Adc_QueueIndexType)0) || \
      (((Adc_GroupConvType)ADC_CONV_TYPE_INJECTED == eType) && \
        (HwInjectedQueueIndex != (Adc_QueueIndexType)0) \
      ) || \
      (((Adc_GroupConvType)ADC_CONV_TYPE_NORMAL == eType) && \
       (HwNormalQueueIndex != (Adc_QueueIndexType)0) \
      ) \
      )
#else
    /* Check for ongoing injected conversion */
    if (Adc_aUnitStatus[Unit].SwInjectedQueueIndex != (Adc_QueueIndexType)0)
#endif /* #if (STD_ON==ADC_HW_TRIGGER_API) */
    {
        /* Return the Group status as IDLE */
        Adc_ReportDetError(ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
    else if ((boolean)TRUE == Adc_aUnitStatus[Unit].bCtuControlOngoing)
    {
        Adc_ReportDetError(ADC_STARTGROUPCONVERSION_ID, (uint8)ADC_E_BUSY);
    }
#endif /* (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */
    else
    {
#if (ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE)
        ValidState = Adc_ValidateNotBusyNoPrio(Group, bImplicitly);
#else /* ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE */
        ValidState = Adc_ValidateNotBusyWithPrio(Group, bImplicitly);
#endif  /* ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE */
    }
    return ValidState;
}
#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) || defined(__DOXYGEN__) */

