marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
    return ValidCallAndGroup;
}
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

#if (ADC_GET_INJECTED_CONVERSION_STATUS_API == STD_ON) || \
    (ADC_CALIBRATION == STD_ON) || \
    (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) || \
    defined(__DOXYGEN__)
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
/**
* @brief        This function validates the call for a specific unit
* @details      This service is non reentrant function on channel used for validating the calls
*               for functions that use a unit
*
* @param[in]    u8ServiceId     The service id of the caller function
* @param[in]    Unit          The unit id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           Valid call and group
* @retval     E_NOT_OK:       Invalid call or group
*
* @api
* @implements     Adc_ValidateCallAndUnit_Activity
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateCallAndUnit
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidCallAndUnit = (Std_ReturnType)E_NOT_OK;
    VAR(boolean, AUTOMATIC) bFoundUnit = (boolean)FALSE;
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex = 0U;

    if (NULL_PTR == Adc_pCfgPtr)
    {
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_UNINIT);
    }
    else
    {
        for(HwIndex = 0U; HwIndex < Adc_pCfgPtr->Misc.Adc_MaxHwCfg; HwIndex++)
        {
            /* Get the index of hardware unit in structure which will match with the hardware unit ID*/
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if(Unit == Adc_pCfgPtr->pAdc[HwIndex].AdcHardwareUnitId)
            {
                bFoundUnit = (boolean)TRUE;
                break;
            }
        }
        if ((boolean)FALSE == bFoundUnit)
        {
            Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_PARAM_UNIT);
        }
        else
        {
            ValidCallAndUnit = (Std_ReturnType)E_OK;
        }
    }

    return ValidCallAndUnit;
}
#endif /* ADC_VALIDATE_CALL_AND_UNIT */
#endif /* (ADC_GET_INJECTED_CONVERSION_STATUS_API == STD_ON) || (ADC_CALIBRATION == STD_ON) */

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
#if (ADC_VALIDATE_NOTIFY_CAPABILITY == STD_ON)
/**
* @brief        This function checks the notification capability of a group.
* @details      This service is non reentrant function on channel used for validating the
*               notification capability of a group.
*
* @param[in]    u8ServiceId     The service id of the caller function
* @param[in]    Group         The group id
*
* @return     Std_ReturnType  Standard return type.
* @retval     E_OK:           Valid notification capability
* @retval     E_NOT_OK:       Invalid notification capability
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_NotifyCapablity
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidCapability = (Std_ReturnType)E_OK;

    switch (u8ServiceId)
    {
        case ADC_ENABLEGROUPNOTIFICATION_ID:
        case ADC_DISABLEGROUPNOTIFICATION_ID:
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if (NULL_PTR == Adc_pCfgPtr->pGroups[Group].Notification)
            {
                ValidCapability = (Std_ReturnType)E_NOT_OK;
                Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_NOTIF_CAPABILITY);
            }
            break;
        }
        default:
        {
            break;
        }
    }
    return ValidCapability;
}
#endif /* ADC_VALIDATE_NOTIFY_CAPABILITY == STD_ON */
#endif /* ADC_GRP_NOTIF_CAPABILITY == STD_ON */

/**
* @brief          Initializes the group status structures.
* @details        Initializes the group status structures with the default values.
*
* @param[in]      void
*
* @return         void
*
* @pre            Driver must be initialized.
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_InitGroupsStatus(void)
{
    VAR(Adc_GroupType,AUTOMATIC) Group = 0U;

    /* Initialize Group Status structures to beginning values */
    for (Group = 0U; Group < Adc_pCfgPtr->GroupCount; Group++)
    {
        Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
        /* this group was not converted yet */
        Adc_aGroupStatus[Group].eAlreadyConverted = ADC_NOT_YET_CONVERTED;

        Adc_aGroupStatus[Group].ResultIndex = 0U;
#ifdef ADC_CURRENT_CHANNEL_USED
        Adc_aGroupStatus[Group].CurrentChannel = 0U;
#endif /* ADC_CURRENT_CHANNEL_USED */
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
        Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)FALSE;
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */

#if (ADC_HW_TRIGGER_API == STD_ON)
        Adc_aGroupStatus[Group].eHwTriggering = ADC_HWTRIGGER_DISABLED;
    #if (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON)
        Adc_aGroupStatus[Group].eCtuTriggering = ADC_HWTRIGGER_DISABLED;
    #endif  /* ADC_ENABLE_CTUTRIG_API == STD_ON */
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
        Adc_aGroupStatus[Group].eNotification = ADC_NOTIFICATION_DISABLED;
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */

#if (ADC_SETCHANNEL_API == STD_ON)
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_aRuntimeGroupChannel[Group].pChannel = Adc_pCfgPtr->pGroups[Group].pAssignment;
    #ifdef ADC_PDB_SUPPORTED
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_aRuntimeGroupChannel[Group].pu16Delays = Adc_pCfgPtr->pGroups[Group].pDelay;
        Adc_aRuntimeGroupChannel[Group].u16Mask = 0xFFFFU;
    #endif /* ADC_PDB_SUPPORTED */
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_aRuntimeGroupChannel[Group].ChannelCount = Adc_pCfgPtr->pGroups[Group].AssignedChannelCount;
        Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated = (boolean)FALSE;
#endif
    }
}

/**
* @brief          Initializes the Unit status structures.
* @details        Initializes the Unit status structures with the default values.
*
* @param[in]      void
*
* @return         void
*
* @pre            Driver must be initialized.
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_InitUnitStatus(void)
{
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) QueueIdx = 0U;

    for(Unit = 0U; Unit < (Adc_HwUnitType)ADC_MAX_HW_UNITS; Unit++)
    {
        /* Filled slots in the queue */
        Adc_aUnitStatus[Unit].SwNormalQueueIndex = 0U;
        /* Mark all the queue slots as "empty" */
        for(QueueIdx = 0U; QueueIdx < ADC_QUEUE_MAX_DEPTH_MAX; QueueIdx++)
        {
            Adc_aUnitStatus[Unit].SwNormalQueue[QueueIdx] = 0U;
        }

        /* SW Injected queue initialization */
        Adc_aUnitStatus[Unit].SwInjectedQueue[0] =0U;
           /* Filled slots in the sw injected queue */
        Adc_aUnitStatus[Unit].SwInjectedQueueIndex = 0U;

#if (ADC_HW_TRIGGER_API == STD_ON)
        Adc_aUnitStatus[Unit].HwInjectedQueue[0] = 0U;
        /* Filled slots in the Hw queue */
        Adc_aUnitStatus[Unit].HwInjectedQueueIndex = 0U;

        Adc_aUnitStatus[Unit].HwNormalQueue[0] = 0U;
        /* Filled slots in the Hw queue */
        Adc_aUnitStatus[Unit].HwNormalQueueIndex = 0U;
    #if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON)
        /* by default consider all groups regular groups */
        Adc_aUnitStatus[Unit].HwQueueGroupType = ADC_REGULAR_GROUP_TYPE;
    #endif /* (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON) */
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    }
#if (ADC_POWER_STATE_SUPPORTED == STD_ON) || defined(__DOXYGEN__)
    Adc_eCurrentState = ADC_FULL_POWER;
    Adc_eTargetState = ADC_NODEFINE_POWER;
#endif /* (ADC_POWER_STATE_SUPPORTED == STD_ON) */
}

