marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
/**
* @brief          Checks if conversion values are in the configured range.
* @details        Return true if conversion values are in the configured range, otherwise false.
*
* @param[in]      value       Adc conversion value.
*                 Unit        Adc Hardware Unit.
*                 Index       Adc channel index assigned to a group.
*
* @return         boolean     Conversion value in range flag.
* @retval         TRUE        if conversion values are in the configured range.
* @retval         FALSE       if conversion values are not in the configured range.
*
* @pre            Driver must be initialized.
* @violates @ref Adc_c_REF_3 internal linkage vs external linkage.
*/
FUNC(boolean, ADC_CODE) Adc_CheckConversionValuesInRange
(
    VAR(Adc_ValueGroupType, AUTOMATIC) Value,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_ChannelType, AUTOMATIC) Index
)
{
    VAR(boolean, AUTOMATIC) bValInRange = (boolean)FALSE;
    VAR(Adc_ChannelRangeSelectType, AUTOMATIC) eChRange;
    VAR(Adc_ValueGroupType, AUTOMATIC) LowLimit;
    VAR(Adc_ValueGroupType, AUTOMATIC) HighLimit;
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex;
    
    HwIndex = Adc_pCfgPtr->Misc.aHwLogicalId[Unit];
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    eChRange = Adc_ChannelsLimitCheckingCfg[HwIndex][Index].eChannelRange;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    LowLimit = (Adc_ValueGroupType)Adc_ChannelsLimitCheckingCfg[HwIndex][Index].ChannelLowLimit;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    HighLimit = (Adc_ValueGroupType)Adc_ChannelsLimitCheckingCfg[HwIndex][Index].ChannelHighLimit;

    switch (eChRange)
    {
        /* Complete range - independent from channel limit settings. */
        case ADC_RANGE_ALWAYS:
        {
            bValInRange = (boolean)TRUE;
            break;
        }
        /* Range between low limit and high limit - high limit value included. */
        case ADC_RANGE_BETWEEN:
        {
            if ((Value > LowLimit) && (Value <= HighLimit))
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Range above high limit or below low limit - low limit value included. */
        case ADC_RANGE_NOT_BETWEEN:
        {
            if ((Value > HighLimit) || (Value <= LowLimit))
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Range below high limit -high limit value included. */
        case ADC_RANGE_NOT_OVER_HIGH:
        {
            if (Value <= HighLimit)
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Range above low limit. */
        case ADC_RANGE_NOT_UNDER_LOW:
        {
            if (Value > LowLimit)
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Range above high limit. */
        case ADC_RANGE_OVER_HIGH:
        {
            if (Value > HighLimit)
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Range below low limit - low limit value included. */
        case ADC_RANGE_UNDER_LOW:
        {
            if (Value <= LowLimit)
            {
                bValInRange = (boolean)TRUE;
            }
            break;
        }
        /* Unexpected value */
        default:
        {
            break;
        }
    }
    return (boolean)bValInRange;
}
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */

#if (ADC_ENABLE_QUEUING == STD_ON)
/**
* @brief          This function performs the dequeue operation on the internal ADC queue.
* @details        This function performs the dequeue operation on the internal ADC queue.
*
* @param[in]      Unit            The used hw Unit.
* @param[in]      CurQueueIndex   The current queue index.
*
* @return         void
*
* @pre This function must be called from a critical region. It is not protecting itself against interruptions.
* @violates @ref Adc_c_REF_3 internal linkage vs external linkage.
*/
FUNC(void, ADC_CODE) Adc_RemoveFromQueue
(
    CONST(Adc_HwUnitType, AUTOMATIC) Unit,
    CONST(Adc_QueueIndexType, AUTOMATIC) CurQueueIndex
)
{
    VAR(Adc_QueueIndexType, AUTOMATIC) PositionIndex = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) CurrentIndex = Adc_aUnitStatus[Unit].SwNormalQueueIndex;

    if((Adc_QueueIndexType)1U >= CurrentIndex)
    {
        /* Zero or one element present in the queue */
        Adc_aUnitStatus[Unit].SwNormalQueueIndex = 0U;
    }
    else
    {
        /* More than one element in the queue */
        /* Move all elements after the one to remove (from CurQueueIndex position) one place to the left */
        for(PositionIndex = (CurQueueIndex + 1U); PositionIndex < CurrentIndex; PositionIndex++)
        {
            Adc_aUnitStatus[Unit].SwNormalQueue[PositionIndex - 1U] =
            (Adc_GroupType)Adc_aUnitStatus[Unit].SwNormalQueue[PositionIndex];
        }
        Adc_aUnitStatus[Unit].SwNormalQueueIndex--;
    }
}
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */

#if ((ADC_ENABLE_START_STOP_GROUP_API == STD_ON) && (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE))
/**
* @brief          This function inserts a group into the queue.
* @details        This function inserts a group into the queue.
*
* @param[in]      Unit      The hardware Unit.
* @param[in]      Group     The group id.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_InsertIntoQueue
(
    CONST(Adc_HwUnitType, AUTOMATIC) Unit,
    VAR(Adc_GroupType, AUTOMATIC) Group
)
{
    /* Temporary index in the Queue */
    VAR(Adc_QueueIndexType, AUTOMATIC) QueueTemp = 0U;
    /* Position of the new Group in the Queue */
    VAR(Adc_QueueIndexType, AUTOMATIC) Pos = 0U;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    VAR(Adc_GroupPriorityType, AUTOMATIC) gPri = Adc_pCfgPtr->pGroups[(Group)].Priority;
    VAR(Adc_QueueIndexType, AUTOMATIC) qPtr = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    VAR(Std_ReturnType, AUTOMATIC) DemTest = (Std_ReturnType)E_OK;

    /* Find the right place in Queue */
    /**
     * @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic
     */
    while(Adc_pCfgPtr->pGroups[(Adc_aUnitStatus[Unit].SwNormalQueue[Pos])].Priority >= gPri)
    {
        Pos++;
        if (Pos >= qPtr)
        {
            break;
        }
    }
    if(0U == Pos)
    {
        /* Highest priority group detected */
        DemTest = Adc_Ipw_StopCurrentConversion(Unit, Adc_aUnitStatus[Unit].SwNormalQueue[0], (boolean)TRUE);
    }
    /* Make space for the new Group */
    if(qPtr > Pos)
    {
        for(QueueTemp = qPtr; QueueTemp > Pos; QueueTemp--)
        {
            /* Move elements to the right */
            /* Compiler_Warning: In case of queue is enabled, if queue size is 1, the code will not be called. */
            Adc_aUnitStatus[Unit].SwNormalQueue[QueueTemp] = (Adc_GroupType)Adc_aUnitStatus[Unit].SwNormalQueue[QueueTemp- 1U];
        }
    }
    /* Place the Group in the Queue */
    Adc_aUnitStatus[Unit].SwNormalQueue[Pos] = Group;
    /* Increase the Queue Index */
    Adc_aUnitStatus[Unit].SwNormalQueueIndex++;
    
    return DemTest;
}
#endif  /* (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) */

