marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
/**
* @brief          This function update queue before start a group conversion.
* @details        This function update queue before start a group conversion.
*
* @param[in]      Group     The group id.
* @param[in]      Unit      The hardware Unit.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusStartConversion
(
    CONST(Adc_GroupType, AUTOMATIC) Group,
    CONST(Adc_HwUnitType, AUTOMATIC) Unit
)
{
#if (ADC_ENABLE_QUEUING == STD_ON)
    /* First available slot in the Queue */
    VAR(Adc_QueueIndexType, AUTOMATIC) qPtr = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) SwNormalQueueIndex;
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */
    VAR(Std_ReturnType, AUTOMATIC) DemTest = (Std_ReturnType)E_OK;

    /* Enter critical region to work on queue, DMA, ADC registers */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_07();
    /* Mark the Group as BUSY when the Group goes to the Queue or gets started */
    Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
    Adc_aGroupStatus[Group].ResultIndex = 0U;

#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)       
    /* Injected conversion mode */
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if ((Adc_GroupConvType)ADC_CONV_TYPE_INJECTED == Adc_pCfgPtr->pGroups[Group].eType)
    {
#ifdef ADC_DMA_SUPPORTED
        if (ADC_DMA == Adc_pCfgPtr->Misc.u8Adc_DmaInterruptSoftware[Unit])
        {
            if (Adc_aUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0U)
            {
                /* Queue is NOT Empty */
                DemTest = Adc_Ipw_StopCurrentConversion(Unit, Adc_aUnitStatus[Unit].SwNormalQueue[0], (boolean)TRUE);
            }
        }
#endif
        /* Place the Group in the SW Inj Queue */
        Adc_aUnitStatus[Unit].SwInjectedQueue[0] = Group;
        /* Increase the Queue Index */
        Adc_aUnitStatus[Unit].SwInjectedQueueIndex++;

        Adc_Ipw_StartInjectedConversion(Unit);
        /* exit critical region */
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_07();
#if ((ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) && defined(ADC_DMA_SUPPORTED))
        /* Dem error was checked and not failed, so it must be reported passed */
        if (((Std_ReturnType)E_OK == DemTest) && ((uint32)STD_ON == Adc_E_TimeoutCfg.state))
        {
            /* Report production error passed.  */
            Dem_ReportErrorStatus((Dem_EventIdType)Adc_E_TimeoutCfg.id, DEM_EVENT_STATUS_PASSED);
        }
#endif /* (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) */
        /** @violates @ref Adc_c_REF_8 Return statement before end of function. */
        return;
    }
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */ 

    /* Normal conversion*/
#if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    qPtr = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    if (qPtr > (Adc_QueueIndexType)0U)
    {
        /* Queue is NOT Empty */
        DemTest = Adc_InsertIntoQueue(Unit, Group);
    }
#else /* ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE */
 #if (ADC_ENABLE_QUEUING == STD_ON)
    qPtr = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    if (qPtr > (Adc_QueueIndexType)0U)
    {
        /* Place the Group in the Queue */
        /* Compiler_Warning: In case of queue is enabled, if queue size is 1, the code will not be called. */
        Adc_aUnitStatus[Unit].SwNormalQueue[qPtr] = Group;
        /* Increase the Queue Index */
        Adc_aUnitStatus[Unit].SwNormalQueueIndex++;
    }
 #else /* ADC_ENABLE_QUEUING == STD_OFF*/
  /* In this case all the StartConversion should be rejected by DET */
 #endif /* (ADC_ENABLE_QUEUING == STD_ON) */
#endif /* ADC_PRIORITY_IMPLEMENTATION == ADC_PRIORITY_NONE */

#if (ADC_ENABLE_QUEUING == STD_ON)
    SwNormalQueueIndex = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
    if((Adc_aUnitStatus[Unit].SwNormalQueue[0] == Group) || (0U == SwNormalQueueIndex))
    {
        /* No_priorities OR Queue_is_empty */
        /* Indicate a new group was added to the queue */
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */
        if (0U == Adc_aUnitStatus[Unit].SwNormalQueueIndex)
        {
            /* Place the Group in the Queue */
            Adc_aUnitStatus[Unit].SwNormalQueue[0] = Group;
            Adc_aUnitStatus[Unit].SwNormalQueueIndex++;
        }

        /* exit critical region */
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_07();

        /* ADC will not be running - no ISR can occur now */
        Adc_Ipw_StartNormalConversion(Unit);

#if (ADC_ENABLE_QUEUING == STD_ON)
    }
    else
    {
        /* exit critical region */
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_07();
    }
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */
#if ((ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) && (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE))
    /* Dem error was checked and not failed, so it must be reported passed */
    if (((Std_ReturnType)E_OK == DemTest) && ((uint32)STD_ON == Adc_E_TimeoutCfg.state))
    {
        /* Report production error passed.  */
        Dem_ReportErrorStatus((Dem_EventIdType)Adc_E_TimeoutCfg.id, DEM_EVENT_STATUS_PASSED);
    }
#endif /* (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) */
    (void)DemTest;   
}

/**
* @brief          This function update queue before start a group conversion.
* @details        This function update queue before start a group conversion.
*
* @param[in]      Group     The group id.
* @param[in]      Unit      The hardware Unit.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusStopConversion
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
#if (ADC_ENABLE_QUEUING == STD_ON)
    VAR(Adc_QueueIndexType, AUTOMATIC) SwNormalQueueIndex = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) RemovedPos = 0U;
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */
    VAR(Std_ReturnType, AUTOMATIC) DemTest = (Std_ReturnType)E_OK;
    VAR(Adc_GroupConvModeType, AUTOMATIC) eMode;
    VAR(Adc_GroupAccessModeType, AUTOMATIC) eAccessMode;
    VAR(Adc_StreamBufferModeType, AUTOMATIC) eBufferMode;
    VAR(Adc_StatusType, AUTOMATIC) eConversion;

    /* Enter critical region to protect against queue changes from ISRs */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_08();
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)FALSE;
#endif /* ADC_ENABLE_LIMIT_CHECK == STD_ON */

    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic shall be the only allowed form of pointer arithmetic */
    eMode = Adc_pCfgPtr->pGroups[Group].eMode;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic shall be the only allowed form of pointer arithmetic */
    eAccessMode = Adc_pCfgPtr->pGroups[Group].eAccessMode;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic shall be the only allowed form of pointer arithmetic */
    eBufferMode = Adc_pCfgPtr->pGroups[Group].eBufferMode;
    eConversion = Adc_aGroupStatus[Group].eConversion;

    /**
     * @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic
     */
    if(((ADC_CONV_MODE_ONESHOT == eMode) || \
        ((ADC_ACCESS_MODE_STREAMING == eAccessMode) && (ADC_STREAM_BUFFER_LINEAR == eBufferMode)) \
       ) && (ADC_STREAM_COMPLETED == eConversion) \
      )
    {
        /* group is stopped, change its status to IDLE  */
        Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
        /* FD reset number of samples completed */
        Adc_aGroupStatus[Group].ResultIndex = 0U;
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
        /* disable group notification (ADC155) */
        Adc_aGroupStatus[Group].eNotification = ADC_NOTIFICATION_DISABLED;
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
#if (ADC_SETCHANNEL_API == STD_ON) && defined(ADC_PDB_SUPPORTED)
        Adc_aRuntimeGroupChannel[Group].u16Mask = 0xFFFFU;
#endif
        /* Exit critical region */
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_08();
        /** @violates @ref Adc_c_REF_8 Return statement before end of function. */
        return;
    }

#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)     
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if ((Adc_GroupConvType)ADC_CONV_TYPE_INJECTED == Adc_pCfgPtr->pGroups[Group].eType)
    {
        if (Group == Adc_aUnitStatus[Unit].SwInjectedQueue[0])
        {
            DemTest = Adc_Ipw_StopCurrentConversion(Unit, Group, (boolean)FALSE);
            /* zero elements in the sw injected queue */
            Adc_aUnitStatus[Unit].SwInjectedQueueIndex = 0U;
        }
    }
    else
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */    
    {
#if (ADC_ENABLE_QUEUING == STD_ON)
        /* Find the Group in the Queue */
        RemovedPos = Adc_aUnitStatus[Unit].SwNormalQueueIndex;  /* initialize with something invalid */
        /* Last valid Group in the Queue */
        SwNormalQueueIndex = Adc_aUnitStatus[Unit].SwNormalQueueIndex - 1U;

