marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
        while (SwNormalQueueIndex < (Adc_QueueIndexType)ADC_QUEUE_INDEX_TYPE_MAXIMUM)
        {
            if (Group == Adc_aUnitStatus[Unit].SwNormalQueue[SwNormalQueueIndex] )
            {
                /* The group is found in the Queue */
                /* Store the position of the group to be removed */
                RemovedPos = SwNormalQueueIndex;

                /* Stop the conversion of all channels belonging to this group */
                if((Adc_QueueIndexType)0U == SwNormalQueueIndex) /* In this case the group might be under conversion */
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */
                {
                    DemTest = Adc_Ipw_StopCurrentConversion(Unit, Group, (boolean)FALSE);
                }
#if (ADC_ENABLE_QUEUING == STD_ON)
                /* Remove group from Queue */
                Adc_RemoveFromQueue(Unit, SwNormalQueueIndex);
            }
            SwNormalQueueIndex--;
        }
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */
    }

    /* group is stopped, change its status to IDLE  */
    Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
    /* FD reset number of samples completed */
    Adc_aGroupStatus[Group].ResultIndex = 0U;
#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    /* disable group notification (ADC155) */
    Adc_aGroupStatus[Group].eNotification = ADC_NOTIFICATION_DISABLED;
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */
#if (ADC_SETCHANNEL_API == STD_ON) && defined(ADC_PDB_SUPPORTED)
    Adc_aRuntimeGroupChannel[Group].u16Mask = 0xFFFFU;
#endif
#if (ADC_ENABLE_QUEUING == STD_ON)
    
    /* Exit critical region */
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_08();
    /* Start the next group in the Queue (if any) */
    if((Adc_QueueIndexType)0U == RemovedPos) 
    {
        if(Adc_aUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0U)
        {
            /* Structures and pointers will be initialized when the next Group starts */
            Adc_Ipw_StartNormalConversion(Unit);
        }
    }
#else
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if ((Adc_GroupConvType)ADC_CONV_TYPE_NORMAL == Adc_pCfgPtr->pGroups[Group].eType)
    {
        /* No element will be present in the queue */
        Adc_aUnitStatus[Unit].SwNormalQueueIndex = 0U;
    }

    /* Exit critical region */
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_08();
#endif /* (ADC_ENABLE_QUEUING == STD_ON) */

#if (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF)
        /* Dem error was checked and not failed, so it must be reported passed */
        if (((Std_ReturnType)E_OK == DemTest) && ((uint32)STD_ON == Adc_E_TimeoutCfg.state))
        {
            /* Report production error passed.  */
            Dem_ReportErrorStatus((Dem_EventIdType)Adc_E_TimeoutCfg.id, DEM_EVENT_STATUS_PASSED);
        }
#else
    (void)DemTest;    
#endif /* (ADC_DISABLE_DEM_REPORT_ERROR_STATUS == STD_OFF) */
}
#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */

#if (ADC_READ_GROUP_API == STD_ON)
/**
* @brief          This function updates the status variables after the read group operation.
* @details        This function updates the status variables after the read group operation.
*
* @param[in]      Group       The group of which conversion will be started.
* @param[in]      bFlag        Indicates if the values are in the configured limit range.
*
* @return         void
*
*/
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusReadGroupNoInt
(
    CONST(Adc_GroupType, AUTOMATIC) Group,
    CONST(boolean, AUTOMATIC) bFlag
)
{
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
#if (ADC_ENABLE_QUEUING == STD_ON)
    VAR(Adc_QueueIndexType, AUTOMATIC) SwNormalQueueIndex = 0U;
#endif 
  
    /* at least once the group was converted */
    Adc_aGroupStatus[Group].eAlreadyConverted = ADC_ALREADY_CONVERTED;
    /* Update conversion status*/
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
    /* Conversion values are not in the configured range */
    if ((boolean)FALSE == bFlag)
    {
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        if(ADC_CONV_MODE_ONESHOT == Adc_pCfgPtr->pGroups[Group].eMode)
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
            if(ADC_TRIGG_SRC_SW == Adc_pCfgPtr->pGroups[Group].eTriggerSource)
            {
                /* ADC449 */
                Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
            }
            else
            {
                /* ADC450 */
                Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
            }
        }
        else
        {
            /* ADC448 */
            Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
        }
        Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)TRUE;
        /** @violates @ref Adc_c_REF_8 Return statement before end of function. */
        return;
    }
    Adc_aGroupStatus[Group].bLimitCheckFailed = (boolean)FALSE;
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if(ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode)
    {
        Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
    }
#else
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if(ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode)
    {
        Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
    }
    (void)bFlag;
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
    /* NOTE: Streaming groups are NOT allowed without interrupts in configuration */
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if ((ADC_CONV_MODE_ONESHOT == Adc_pCfgPtr->pGroups[Group].eMode) && \
         ( ADC_TRIGG_SRC_SW == Adc_pCfgPtr->pGroups[Group].eTriggerSource) \
       )
    {
        Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
#if (ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON)             
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        if ((Adc_GroupConvType)ADC_CONV_TYPE_INJECTED == Adc_pCfgPtr->pGroups[Group].eType)
        {
            if (Adc_aUnitStatus[Unit].SwInjectedQueueIndex > (Adc_QueueIndexType)0)
            {
                /* empty queue of  SW injected conversions */
                Adc_aUnitStatus[Unit].SwInjectedQueueIndex--;
            }
        }
        else /* SW NORMAL CONVERSION */
#endif /* ADC_SOFTWARE_INJECTED_CONVERSIONS_USED == STD_ON */            
        {
            if (Adc_aUnitStatus[Unit].SwNormalQueueIndex > (Adc_QueueIndexType)0)
            {
#if (ADC_ENABLE_QUEUING == STD_ON)
                SwNormalQueueIndex = Adc_aUnitStatus[Unit].SwNormalQueueIndex - 1U;
                /* remove group without interrupts from queue  */
                while (SwNormalQueueIndex < (Adc_QueueIndexType)ADC_QUEUE_INDEX_TYPE_MAXIMUM)
                {
                    if (Group == Adc_aUnitStatus[Unit].SwNormalQueue[SwNormalQueueIndex])
                    {
                        /* The group is found in the Queue */
                        Adc_RemoveFromQueue(Unit, SwNormalQueueIndex);
                        break;
                    }
                    SwNormalQueueIndex--;
                }
#if (ADC_ENABLE_START_STOP_GROUP_API == STD_ON)
                /* Start / restore next conversion in the queue*/
                if (0U == SwNormalQueueIndex)
                {
                    if(Adc_aUnitStatus[Unit].SwNormalQueueIndex > 0U)
                    {
                        Adc_Ipw_StartNormalConversion(Unit);
                    }
                }
#endif /* (ADC_ENABLE_START_STOP_GROUP_API == STD_ON) */
#else
            Adc_aUnitStatus[Unit].SwNormalQueueIndex--;
#endif
            }
        }
    }
    else
    {
        Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
    }
}


LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusReadGroupInt
(
    CONST(Adc_GroupType, AUTOMATIC) Group
)
{
    /* The following code has been added to respect the State Diagram of Streaming Access Mode */
    if (ADC_COMPLETED == Adc_aGroupStatus[Group].eConversion)
    {
        Adc_aGroupStatus[Group].ResultIndex = 0U;
        /* ADC331 -- ADC222*/
        Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
    }
    else
    {
        /* Compliance with State Diagram */
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        if (ADC_TRIGG_SRC_SW == Adc_pCfgPtr->pGroups[Group].eTriggerSource)
        {
            if (ADC_STREAM_COMPLETED == Adc_aGroupStatus[Group].eConversion)
            {
                /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
                if((ADC_CONV_MODE_ONESHOT == Adc_pCfgPtr->pGroups[Group].eMode)|| \
                   ((ADC_CONV_MODE_CONTINUOUS == Adc_pCfgPtr->pGroups[Group].eMode) && \
                    (ADC_ACCESS_MODE_STREAMING == Adc_pCfgPtr->pGroups[Group].eAccessMode) && \
                    (ADC_STREAM_BUFFER_LINEAR == Adc_pCfgPtr->pGroups[Group].eBufferMode)
                   )
                  )
                {
                    /* ADC330 - ADC221 */
                    Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
                }
                else
                { /* Continuous*/
                    /* ADC329 -- ADC222 */
                    Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
                }
            }
        }
#if (ADC_HW_TRIGGER_API == STD_ON)
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        else if (ADC_TRIGG_SRC_HW == Adc_pCfgPtr->pGroups[Group].eTriggerSource)
        {
            /* Hw Trigger*/
            if (ADC_STREAM_COMPLETED == Adc_aGroupStatus[Group].eConversion)
            {
                /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
                if((ADC_ACCESS_MODE_STREAMING == Adc_pCfgPtr->pGroups[Group].eAccessMode)&& \
                (ADC_STREAM_BUFFER_LINEAR == Adc_pCfgPtr->pGroups[Group].eBufferMode)
                )
                {
                    /* ADC330 - ADC221*/
                    Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
                }
                else
                { /* Simple One-shot mode, in other words in single access mode*/
                    /* ADC329 -- ADC222*/
                    Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
                }
            }
        }
        else
        {
            /* Nothing for misra */
        }
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    }
}

