marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
#endif /* (ADC_READ_GROUP_API == STD_ON) */

#if (ADC_HW_TRIGGER_API == STD_ON)
LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusEnableHardware
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    /* Enter critical section */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_10();

#if (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON)
    /* if the queue is empty than simply copy into the groups in queue type the first group type */
    if ((Adc_QueueIndexType)0 == Adc_aUnitStatus[Unit].HwInjectedQueueIndex)
    {
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Adc_aUnitStatus[Unit].HwQueueGroupType = Adc_pCfgPtr->pGroups[Group].IsMHTGroup;
    }
#endif /* (ADC_MULTIPLE_HARDWARE_TRIGGERS == STD_ON) */

#if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if((Adc_GroupConvType)ADC_CONV_TYPE_NORMAL == Adc_pCfgPtr->pGroups[Group].eType)
    {
        Adc_aUnitStatus[Unit].HwNormalQueue[Adc_aUnitStatus[Unit].HwNormalQueueIndex] = Group;
        Adc_aUnitStatus[Unit].HwNormalQueueIndex++;
    }
    else
#endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */
    {
        Adc_aUnitStatus[Unit].HwInjectedQueue[Adc_aUnitStatus[Unit].HwInjectedQueueIndex] = Group;
        Adc_aUnitStatus[Unit].HwInjectedQueueIndex++;
    }

    /* Mark the Group as BUSY when the Group goes to the Queue or gets started */
    /* ADC222 */
    Adc_aGroupStatus[Group].eConversion = ADC_BUSY;
    /* if HW trigger is enabled for a group, its HW trigger status becomes ENABLED */
    Adc_aGroupStatus[Group].eHwTriggering = ADC_HWTRIGGER_ENABLED;
    /* ADC432 */
    /* Put the conversion results from Results Buffer Base Address */
    Adc_aGroupStatus[Group].ResultIndex = 0U;
    /*Mark the Unit as BUSY */

    /* Exit critical section */
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_10();
}

LOCAL_INLINE FUNC(void, ADC_CODE) Adc_UpdateStatusDisableHardware
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    /* Enter critical section */
    SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_11();

#if (ADC_GRP_NOTIF_CAPABILITY == STD_ON)
    /* [ADC157] if HW trigger is disabled for a group, its HW trigger status becomes DISABLED */
    Adc_aGroupStatus[Group].eNotification = ADC_NOTIFICATION_DISABLED;
#endif /* (ADC_GRP_NOTIF_CAPABILITY == STD_ON) */

    /* ADC361*/
    /* Mark the Group status as IDLE */
    Adc_aGroupStatus[Group].eConversion = ADC_IDLE;
    /* Hardware trigger is disabled */
    Adc_aGroupStatus[Group].eHwTriggering = ADC_HWTRIGGER_DISABLED;
#if (ADC_SETCHANNEL_API == STD_ON) && defined(ADC_PDB_SUPPORTED)
    Adc_aRuntimeGroupChannel[Group].u16Mask = 0xFFFFU;
#endif
    /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
    if((Adc_GroupConvType)ADC_CONV_TYPE_INJECTED == Adc_pCfgPtr->pGroups[Group].eType)
    {
        if(Adc_aUnitStatus[Unit].HwInjectedQueueIndex > 0U)
        {
            /* ADC429 */
            Adc_aUnitStatus[Unit].HwInjectedQueueIndex--;
        }
    }
#if (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON)
    else
    {
        if(Adc_aUnitStatus[Unit].HwNormalQueueIndex > 0U)
        {
            /* ADC429 */
            Adc_aUnitStatus[Unit].HwNormalQueueIndex--;
        }
    }
#endif /* (ADC_HARDWARE_NORMAL_CONVERSIONS_USED == STD_ON) */

    /* Exit critical section */
    SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_11();
}
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */


/*==================================================================================================
                                       GLOBAL FUNCTIONS
==================================================================================================*/

/**
* @brief          Initializes the ADC hardware unit and the driver.
* @details        This function will initialize both the ADC HW unit and the driver structures.
*
* @param[in]      pConfigPtr   Pointer to configuration set in Variant PB
*                             (Variant PC requires a NULL_PTR).
* @return         void
*
* @api
*
* @post           Initializes the driver.
*
*
* @note           The function Autosar Service ID[hex]: 0x00.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements  Adc_Init_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_Init
(
    P2CONST(Adc_ConfigType, AUTOMATIC, ADC_APPL_CONST) ConfigPtr
)
{
#if ((ADC_VALIDATE_GLOBAL_CALL == STD_ON) || (ADC_VALIDATE_PARAMS == STD_ON))
    VAR(Std_ReturnType, AUTOMATIC) ValidStatus = (Std_ReturnType)E_NOT_OK;
#endif

#if (ADC_VALIDATE_GLOBAL_CALL == STD_ON)
    ValidStatus = Adc_ValidateGloballCall(ADC_INIT_ID);
    if ((Std_ReturnType)E_OK == ValidStatus)
    {
#endif /* ADC_VALIDATE_GLOBAL_CALL == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        ValidStatus = Adc_ValidatePtrInit(ConfigPtr);
        if ((Std_ReturnType)E_OK == ValidStatus)
        {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#ifdef ADC_PRECOMPILE_SUPPORT
            /* ADC342 */
            Adc_pCfgPtr = &Adc_PBCfgVariantPredefined;
            (void)ConfigPtr;
#else
            /* ADC054 */
            Adc_pCfgPtr = ConfigPtr;
#endif /* ADC_PRECOMPILE_SUPPORT */

            /* Initialize the unit status for all units */
            Adc_InitUnitStatus();
            /* Initialize the group status for all groups */
            Adc_InitGroupsStatus();
            /* Call the low level function to initialize driver */
            Adc_Ipw_Init(Adc_pCfgPtr);

#if (ADC_VALIDATE_PARAMS == STD_ON)
        }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#if (ADC_VALIDATE_GLOBAL_CALL == STD_ON)
    }
    Adc_EndValidateGloballCall(ValidStatus, ADC_INIT_ID);
#endif /* ADC_VALIDATE_GLOBAL_CALL == STD_ON */
}

/**
* @brief          Initializes the group specific ADC result buffer pointer as
*                 configured to point to the pDataBufferPtr address which is
*                 passed as parameter.
* @details        Initializes ADC driver with the group specific result buffer
*                 start address where the conversion results will be stored.
*                 The application has to ensure that the application buffer,
*                 where pDataBufferPtr points to, can hold all the conversion
*                 results of the specified group. The initialization with
*                 Adc_SetupResultBuffer is required after reset, before a group
*                 conversion can be started.
*
* @param[in]      Group           Numeric ID of requested ADC channel group.
* @param[in]      pDataBufferPtr   Pointer to result data buffer
*
* @return         Std_ReturnType  Standard return type.
* @retval         E_OK:           Result buffer pointer initialized correctly.
* @retval         E_NOT_OK:       Operation failed or development error
*                                 occurred.
*
* @api
*
* @note           The function Autosar Service ID[hex]: 0x0C.
* @note           Synchronous.
* @note           Re-entrant function.
* @implements  Adc_SetupResultBuffer_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_SetupResultBuffer
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) DataBufferPtr
)
{
    VAR(Std_ReturnType, AUTOMATIC) TempReturn = (Std_ReturnType)E_NOT_OK;
    P2CONST(Adc_GroupConfigurationType, AUTOMATIC, ADC_APPL_CONST) pGroupPtr = NULL_PTR;

