marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_GETSTREAMLASTPOINTER_ID, Group))
    {
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

#if (ADC_VALIDATE_STATE == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidateStateNotIdle(ADC_GETSTREAMLASTPOINTER_ID, Group))
        {
#endif /* ADC_VALIDATE_STATE == STD_ON */

            *PtrToSamplePtr = (Adc_ValueGroupType *)NULL_PTR;

            /* Enter critical region */
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_12();

            /** @violates @ref Adc_c_REF_4 only Array indexing shall be allowed */
            if (ADC_IDLE != Adc_aGroupStatus[Group].eConversion)
            {
                if (ADC_BUSY != Adc_aGroupStatus[Group].eConversion)
                {
                    if ((Adc_StreamNumSampleType)0U == Adc_aGroupStatus[Group].ResultIndex)
                    {
                        /** @violates @ref Adc_c_REF_4 only Array indexing shall be allowed */
                        ResultIndex = Adc_pCfgPtr->pGroups[Group].NumSamples - (Adc_StreamNumSampleType)1U;
                        /* ADC387 Note */
                        /** @violates @ref Adc_c_REF_4 only Array indexing shall be allowed */
                        NumberOfResults = Adc_pCfgPtr->pGroups[Group].NumSamples;
                    }
                    else
                    {
                        ResultIndex = Adc_aGroupStatus[Group].ResultIndex - (Adc_StreamNumSampleType)1U;
                        NumberOfResults = Adc_aGroupStatus[Group].ResultIndex;
                    }
       
                    /* ADC214 -- ADC418 -- ADC382*/
                    /** @violates @ref Adc_c_REF_10 cast from pointer to pointer */
                    /** @violates @ref Adc_c_REF_4 only Array indexing shall be allowed */
                    *PtrToSamplePtr = (Adc_ValueGroupType *)(Adc_pCfgPtr->pGroups[Group].pResultsBufferPtr[Group] + \
                                                            ResultIndex \
                                                            );
                    Adc_UpdateStatusAfterGetStream(Group);
                }
            }

            /* Exit critical region */
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_12();

#if (ADC_VALIDATE_STATE == STD_ON)
        }
        else
        {
            *PtrToSamplePtr = NULL_PTR;
        }
#endif /* ADC_VALIDATE_STATE == STD_ON */

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    }
    else
    {
        *PtrToSamplePtr = NULL_PTR;
    }
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

    return (NumberOfResults);
}

#if (ADC_VERSION_INFO_API == STD_ON) || defined(__DOXYGEN__)
/**
* @brief          Returns the version information of this module.
* @details        Returns the version information of this module.
*
* @param[out]     pVersionInfo    Pointer to where to store the version
*                                 information of this module.
* @retval         structure       in case of no errors.
* @api
*
* @note           The function Autosar Service ID[hex]: 0x0A.
* @note           Synchronous.
* @note           Reentrant function.
* @implements     Adc_GetVersionInfo_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_GetVersionInfo
(
    P2VAR(Std_VersionInfoType , AUTOMATIC, ADC_APPL_DATA) versionInfo
)
/** @violates @ref Adc_c_REF_2 The identifiers used in the declaration and definition of a function shall be identical */
{
#if (ADC_VALIDATE_PARAMS == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidatePtr(ADC_GETVERSIONINFO_ID, versionInfo))
    {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

        (versionInfo)->vendorID = (uint16)ADC_VENDOR_ID;
        (versionInfo)->moduleID = (uint16)ADC_MODULE_ID;
        (versionInfo)->sw_major_version = (uint8)ADC_SW_MAJOR_VERSION;
        (versionInfo)->sw_minor_version = (uint8)ADC_SW_MINOR_VERSION;
        (versionInfo)->sw_patch_version = (uint8)ADC_SW_PATCH_VERSION;

#if (ADC_VALIDATE_PARAMS == STD_ON)
    }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */
}
#endif /* (ADC_VERSION_INFO_API == STD_ON) || defined(__DOXYGEN__) */

#if (ADC_POWER_STATE_SUPPORTED == STD_ON) || defined(__DOXYGEN__)
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateAndPtr
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
)
{
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_OK;
    
    if (NULL_PTR == pResult)
    {
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_PARAM_POINTER);
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
        RetVal = (Std_ReturnType)E_NOT_OK;
    }
    else if(NULL_PTR == Adc_pCfgPtr)
    {
        /* Adc module is not initialized */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
        Adc_ReportDetError(u8ServiceId, ADC_E_UNINIT);
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
        
        *pResult = ADC_NOT_INIT;
        RetVal = (Std_ReturnType)E_NOT_OK;
    }
    else
    {
        /* Nothing for misra */
    }
    return RetVal;
}

LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateIdleState
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
)
{
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_OK;
    VAR(Adc_HwUnitType, AUTOMATIC) Unit;
    VAR(Adc_QueueIndexType, AUTOMATIC) SwNormalQueueIdx;
    VAR(Adc_QueueIndexType, AUTOMATIC) SwInjQueueIdx;
#if (ADC_HW_TRIGGER_API == STD_ON)
    VAR(Adc_QueueIndexType, AUTOMATIC) HwNormalQueueIdx;
    VAR(Adc_QueueIndexType, AUTOMATIC) HwInjQueueIdx;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
    VAR(Adc_HwUnitType, AUTOMATIC) HwIndex = 0U;
    
    for(HwIndex = 0U; HwIndex < Adc_pCfgPtr->Misc.Adc_MaxHwCfg; HwIndex++)
    {
        /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of pointer arithmetic */
        Unit = Adc_pCfgPtr->pAdc[HwIndex].AdcHardwareUnitId;
        SwNormalQueueIdx = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
        SwInjQueueIdx = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;
#if (ADC_HW_TRIGGER_API == STD_ON)
        HwNormalQueueIdx = Adc_aUnitStatus[Unit].HwNormalQueueIndex;
        HwInjQueueIdx = Adc_aUnitStatus[Unit].HwInjectedQueueIndex;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

