marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
        if((SwNormalQueueIdx > 0U) || (SwInjQueueIdx > 0U)
#if (ADC_HW_TRIGGER_API == STD_ON)
           || (HwNormalQueueIdx > 0U) || (HwInjQueueIdx > 0U)
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
           ||((boolean)TRUE == Adc_aUnitStatus[Unit].bCtuControlOngoing)
#endif /* if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON) */
          )
        {
            /* Adc conversion is ongoing */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
            Adc_ReportDetError(u8ServiceId, ADC_E_NOT_DISENGAGED);
#endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
            *pResult = ADC_SEQUENCE_ERROR;
            RetVal = (Std_ReturnType)E_NOT_OK;
            break;
        }
    }/* end for(HwIndex = 0U; HwIndex <... */    
    return RetVal;
}

LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidatePowerStateSupport
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_PowerStateType, AUTOMATIC) ePowerState,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
)
{
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_OK;
    
    /* If the power state is not supported or low power state is not supported at all */
    if(ePowerState >= ADC_NODEFINE_POWER)
    {
        /* The state is not supported */
        #if (ADC_DEV_ERROR_DETECT == STD_ON)
        Adc_ReportDetError(u8ServiceId, ADC_E_POWER_STATE_NOT_SUPPORTED);
        #endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        *pResult = ADC_POWER_STATE_NOT_SUPP;
        RetVal = (Std_ReturnType)E_NOT_OK;
    }
    return RetVal;
}

LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidatePowerStatePrepare
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) pResult
)
{
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_OK;
    
    /* If the terget state is invalid state */
    if(Adc_eTargetState >= ADC_NODEFINE_POWER)
    {
        /* The target power state is not prepared */
        #if (ADC_DEV_ERROR_DETECT == STD_ON)
        Adc_ReportDetError(u8ServiceId, ADC_E_PERIPHERAL_NOT_PREPARED);
        #endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */

        *pResult = ADC_SEQUENCE_ERROR;
        RetVal = (Std_ReturnType)E_NOT_OK;
    }
    return RetVal;
}

/**
* @brief          Enters the already prepared power state.
* @details        This API configures the Adc module so that it enters the already prepared power 
*                 state, chosen between a predefined set of configured ones.
*
* @param[out]     Result        Pointer to a variable to store the result of this function
*                 
* @return         Std_ReturnType  Standard return type.
* @retval         E_OK:           Power Mode changed.
* @retval         E_NOT_OK:       Request rejected.
*
* @api
*
* @post           Enters the already prepared power state.
*
*
* @note           The function Autosar Service ID[hex]: 0x10.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_SetPowerState_Activity
*
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_SetPowerState
(
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) Result
)
{
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_NOT_OK;

    if((Std_ReturnType)E_OK == Adc_ValidateStateAndPtr(ADC_SETPOWERSTATE_ID, Result))
    {
        if((Std_ReturnType)E_OK == Adc_ValidatePowerStatePrepare(ADC_SETPOWERSTATE_ID, Result))
        {
            if((Std_ReturnType)E_OK == Adc_ValidatePowerStateSupport(ADC_SETPOWERSTATE_ID, Adc_eTargetState, Result))
            {
                if((Std_ReturnType)E_OK == Adc_ValidateIdleState(ADC_SETPOWERSTATE_ID, Result))
                {
                    if(Adc_eCurrentState == Adc_eTargetState)
                    {
                        /* The target state is the same as the current one, return a "Sequence Error" status */
                        *Result = ADC_SEQUENCE_ERROR;
                    }
                    else
                    {
                        RetVal = Adc_Ipw_SetPowerState(Adc_eTargetState);
                        if((Std_ReturnType)E_OK == RetVal)
                        {
                            /* Everything is ok */
                            *Result = ADC_SERVICE_ACCEPTED;
                            Adc_eCurrentState = Adc_eTargetState;
                            Adc_eTargetState = ADC_NODEFINE_POWER;
                        }
                        else
                        {
                            #if (ADC_DEV_ERROR_DETECT == STD_ON)
                            Adc_ReportDetError(ADC_SETPOWERSTATE_ID, ADC_E_TRANSITION_NOT_POSSIBLE);
                            #endif /* (ADC_DEV_ERROR_DETECT == STD_ON) */
                            /* Hardware failure */
                            *Result = ADC_HW_FAILURE;
                        }
                    }
                }
            }
        }
    }
    
    return RetVal;
}

/**
* @brief          Get the current power state of the ADC HW unit.
* @details        This API returns the current power state of the ADC HW unit.
*
* @param[out]     CurrentPowerState     The current power mode of the ADC HW Unit is returned in this parameter
* @param[out]     Result                Pointer to a variable to store the result of this function
*                 
* @return         Std_ReturnType  Standard return type.
* @retval         E_OK:           Mode could be read.
* @retval         E_NOT_OK:       Service is rejected.
*
* @api
*
* @post           Returns the current power state of the ADC HW unit.
*
*
* @note           The function Autosar Service ID[hex]: 0x11.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_GetCurrentPowerState_Activity
*
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_GetCurrentPowerState
(
    P2VAR(Adc_PowerStateType, AUTOMATIC, ADC_APPL_DATA) CurrentPowerState,
    P2VAR(Adc_PowerStateRequestResultType, AUTOMATIC, ADC_APPL_DATA) Result
)
{
    VAR(Std_ReturnType, AUTOMATIC) RetVal = (Std_ReturnType)E_NOT_OK;

