marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */
}

/**
* @brief          Disable the TriggerSource for group selected by Group parameter.
* @details        This non Autosar API is used to disable the already enabled
*                 TriggerSource of the Group.
*
* @param[in]      Group            Index of group.
* @param[in]      TriggerSource    Trigger source to be disabled for the group.
*                                  (Configuration file should contain it for that group).
* @return         void
*
* @api
*
* @note           The function Service ID[hex]: 0x0F.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_DisableCTUTrigger_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_DisableCTUTrigger
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    VAR(Adc_HwTriggerTimerType, AUTOMATIC) TriggerSource
)
{
#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_DISABLECTUTRIGGER_ID, Group))
    {
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidateExtraParams(ADC_DISABLECTUTRIGGER_ID,
                                                            ADC_E_WRONG_TRIGG_SRC_LIST | \
                                                            ADC_E_WRONG_CONV_MODE_LIST,
                                                            Group
                                                           )
           )
        {
            if ((Std_ReturnType)E_OK == Adc_ValidateCtuTriggerSrc(ADC_DISABLECTUTRIGGER_ID, Group, TriggerSource))
            {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */
                Adc_Ipw_DisableCtuTrigger(Group, TriggerSource);
#if (ADC_VALIDATE_PARAMS == STD_ON)
            }
        }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */
}

/**
* @brief          Read the result of the hardware triggered groups conversion result.
* @details        This non Autosar API is used to read the result of the hardware
*                 triggered groups conversion result from the ADC hardware register
*                 in this case the CTU interrupt will be disabled for the group.
*                 The VALID bit CDR register will be cleared automatically when we read the results
*                 from the channel data register. If the user calls non-Autosar function
*                 Adc_HwResultReadGroup() once again before the next conversion takes place, the
*                 Adc_HwResultReadGroup() returns E_NOT_OK.
*
* @param[in]      Group      Index of group.
* @param[in]      pDataPtr    Pointer to a buffer which will be filled by the
*                            conversion results.
* @return         Std_ReturnType Standard return type.
* @retval         E_OK:          results are available and written to the
*                                data buffer.
* @retval         E_NOT_OK:      no results are available or development
*                                error occurred.
* @api
* @note           The function Service ID[hex]: 0x0D.
* @note           Synchronous.
* @note           Non Re-entrant function.
* @implements     Adc_HwResultReadGroup_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_HwResultReadGroup
(
    VAR(Adc_GroupType, AUTOMATIC) Group,
    P2VAR(Adc_ValueGroupType, AUTOMATIC, ADC_APPL_DATA) DataPtr
)
{
    /* Standard return value */
    VAR(Std_ReturnType, AUTOMATIC) GroupRet = (Std_ReturnType)E_NOT_OK;

#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_HWRESULTREADGROUP_ID, Group))
    {
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        if (NULL_PTR == DataPtr)
        {
            GroupRet = (Std_ReturnType)E_NOT_OK;
        }
        else
#endif
        {
            GroupRet = Adc_Ipw_HwResultReadGroup(Group, DataPtr);
        }
#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */
    return(GroupRet);
}
#endif /* (ADC_ENABLE_CTUTRIG_NONAUTO_API == STD_ON) || defined(__DOXYGEN__) */

#if (ADC_ENABLE_CH_DISABLE_CH_NONAUTO_API == STD_ON) || defined(__DOXYGEN__)
/**
* @brief          Enable a channel inside a group.
* @details        This function allows to active a channel assigned to a group for SW normal
*                 conversion
*
* @param[in]      Group         Symbolic name of group.
* @param[in]      Channel       Symbolic name of channel.
* @return         void
*
* @api
*
* @note           The function Service ID[hex]: 0x12.
* @note           Synchronous.
* @note           Re-entrant function.
* @implements     Adc_EnableChannel_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_EnableChannel
(
   VAR(Adc_GroupType, AUTOMATIC) Group,
   VAR(Adc_ChannelType, AUTOMATIC) Channel
)
{
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = (Adc_HwUnitType)0;
    VAR(Adc_ChannelType, AUTOMATIC) ChId;
    VAR(Adc_GroupType, AUTOMATIC) GroupId = ADC_ENABLE_CH_DISABLE_CH_INVALID_GROUP_INDEX;
    VAR(Adc_NCMRType , AUTOMATIC) CMRMask;
    
#if (ADC_VALIDATE_CALL_AND_GROUP == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_ENABLE_CHANNEL_ID, Group))
    {
#endif /* ADC_VALIDATE_CALL_AND_GROUP == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidateExtraParams(ADC_ENABLE_CHANNEL_ID,
                                                            ADC_E_WRONG_TRIGG_SRC_LIST | \
                                                            ADC_E_WRONG_CONV_MODE_LIST | \
                                                            ADC_E_WRONG_ENABLE_CH_DISABLE_CH_GROUP_LIST | \
                                                            ADC_E_WRONG_ENABLE_CH_DISABLE_CH_ID_LIST, \
                                                            Group \
                                                           )
           )
        {
            if ((Std_ReturnType)E_OK == Adc_ValidateEnableDisbleIdList(ADC_ENABLE_CHANNEL_ID, Group, Channel))
            {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */
                /* Get the unit to which the group belongs to */
                /** @violates @ref Adc_c_REF_4 Array indexing */
                Unit = Adc_pCfgPtr->pGroups[(Group)].HwUnit;
                /** @violates @ref Adc_c_REF_4 Array indexing */
                ChId = Adc_pCfgPtr->pChannels[Unit][Channel].ChId;
                /** @violates @ref Adc_c_REF_4 Array indexing */
                GroupId = (Adc_GroupType)Adc_pCfgPtr->pGroups[Group].EnableChDisableChGroupIndex;
                
                /* Global Interrupt disable to protect code section */
                SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_25();
                /** @violates @ref Adc_c_REF_7 It is needed for calculation value of go back space for source address.*/
                Adc_GetCMR_Register(Unit, Group, &CMRMask);
                if(ChId < ADC_ST_EXTENDED_CH_U8)
                {
                    /* Precision channel */
                    Adc_aNCMRxMask[GroupId].Adc_u32NCMR0 = (CMRMask.Adc_u32NCMR0 | (1UL << ChId));
                }
                else if ((ChId >= ADC_ST_EXTENDED_CH_U8) && (ChId <= ADC_ED_EXTENDED_CH_U8))
                {
                    /* Standard channel */
                    Adc_aNCMRxMask[GroupId].Adc_u32NCMR1 = (CMRMask.Adc_u32NCMR1 | (1UL << (ChId - ADC_ST_EXTENDED_CH_U8)));
                }
                else if ((ChId >= ADC_ST_EXTERNAL_CH_U8) && (ChId <= ADC_ED_EXTERNAL_CH_U8))
                {
                    /* External multiplexed channel */
                    Adc_aNCMRxMask[GroupId].Adc_u32NCMR2 = (CMRMask.Adc_u32NCMR2 | (1UL << (ChId - ADC_ST_EXTERNAL_CH_U8)));
                }
                else
                {
                    /* nothing for misra */
                }
                SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_25();
#if (ADC_VALIDATE_PARAMS == STD_ON)
            }
        }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

