marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
    return (eTempReturn);
}
#endif /* (ADC_GET_INJECTED_CONVERSION_STATUS_API) || defined(__DOXYGEN__) */

#if (ADC_CALIBRATION == STD_ON)
/**
* @brief          Executes high accuracy calibration of a ADC HW unit.
* @details        This function calibrates the ADC HW unit and updates calibration related registers
*
* @param[in]      Unit      ADC Unit Id.
* @param[in]      pStatus    Status of the ADC HW unit calibration and
*                           list of failed and passed tests.
*
* @return         void
*
* @api
*
* @note           The function Service ID[hex]: 0x15.
* @implements  Adc_Calibrate_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(void, ADC_CODE) Adc_Calibrate
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit,
    P2VAR(Adc_CalibrationStatusType , AUTOMATIC, ADC_APPL_DATA) pStatus
)
{ 
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_CALIBRATE_ID, Unit))
    {
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */

#if (ADC_VALIDATE_PARAMS == STD_ON)
        if ((Std_ReturnType)E_OK == Adc_ValidatePtr(ADC_CALIBRATE_ID, pStatus))
        {
#endif /* ADC_VALIDATE_PARAMS == STD_ON */
            if ((Std_ReturnType)E_OK == Adc_ValidateNotBusyNoQueue(Unit, ADC_CALIBRATE_ID))
            {
                
                if ((Std_ReturnType)E_OK == Adc_ValidateCheckGroupNotConversion(ADC_CALIBRATE_ID))
                {
                    pStatus->Adc_UnitSelfTestStatus = (Std_ReturnType) E_NOT_OK;
                    Adc_Ipw_Calibrate(Unit, pStatus);
                }
            }
#if (ADC_VALIDATE_PARAMS == STD_ON)
        }
#endif /* ADC_VALIDATE_PARAMS == STD_ON */

#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */
}
#endif /* ADC_CALIBRATION == STD_ON */

#if (ADC_SELF_TEST == STD_ON)
/**
* @brief          Executes hardware Self Test of a ADC HW unit.
* @details        This function checks if the ADC HW unit is functioning correctly
*
* @param[in]      Unit    ADC Unit Id.
*
* @return         Std_ReturnType. Status of the ADC HW unit Self Test.
*
* @api
*
* @note           The function Service ID[hex]: 0x16.
* @implements  Adc_SelfTest_Activity
*/
/**
* @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required
*/
FUNC(Std_ReturnType, ADC_CODE) Adc_SelfTest
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(Std_ReturnType, AUTOMATIC) ReturnValue = (Std_ReturnType)E_NOT_OK;

#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_SELFTEST_ID , Unit))
    {
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */

        ReturnValue = Adc_Ipw_SelfTest(Unit);

#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    }
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */
    return ReturnValue;
}
#endif

#if (ADC_ENABLE_CONFIGURE_THRESHOLD_NONAUTO_API == STD_ON) || defined(__DOXYGEN__)
/**
 * @brief   Function to reconfigure High and Low thresholds for a given group.
 *
 * @details This Non Autosar API is used to reconfigure High and Low thresholds for a given group.
 *
 * @note    The function Service ID[hex]: 0x14.
 *
 * @param[in]  GroupId          Index of group
 * @param[in]  LowValue         Low threshold value for channels in the group
 * @param[in]  HighValue        High threshold value for channels in the group
 *
 * @return         Std_ReturnType  E_OK or E_NOT_OK.
 * @retval         E_OK            In case of successful Configure Threshold.
 * @retval         E_NOT_OK        In case of unsuccessful ConfigureThreshold.
 *
 * @implements Adc_ConfigureThreshold_Activity
 *
 * @api
 */
/** @violates @ref Adc_c_REF_3 All declarations and definitions of objects or */
FUNC(Std_ReturnType, ADC_CODE) Adc_ConfigureThreshold
(
    VAR(Adc_GroupType, AUTOMATIC) GroupId,
    VAR(Adc_ValueGroupType, AUTOMATIC) LowValue,
    VAR(Adc_ValueGroupType, AUTOMATIC) HighValue
)
{
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    VAR(Adc_HwUnitType, AUTOMATIC) Unit = 0U;
    VAR(Adc_ChannelIndexType, AUTOMATIC) ChCount = 0U;
    VAR(Adc_ChannelType, AUTOMATIC) Ch = 0U;
    VAR(boolean, AUTOMATIC) bErrorFlag = (boolean)FALSE;
    VAR(boolean, AUTOMATIC) bThresholdEnabled = (boolean)FALSE;
#endif /* if (ADC_DEV_ERROR_DETECT == STD_ON) */
    VAR(Std_ReturnType, AUTOMATIC) ConThdRet = (Std_ReturnType)E_NOT_OK;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    if (NULL_PTR == Adc_pCfgPtr)
    {
        /* Error (ADC302): called prior to initializing */
        Adc_ReportDetError((uint8)ADC_CONFIGURE_THRESHOLD_ID, (uint8)ADC_E_UNINIT);
        bErrorFlag = (boolean)TRUE;
    }
    else if (GroupId >= Adc_pCfgPtr->GroupCount)
    {
        /* Error (ADC218): non-existing group ID */
        Adc_ReportDetError(ADC_CONFIGURE_THRESHOLD_ID, (uint8)ADC_E_PARAM_GROUP);
        bErrorFlag = (boolean)TRUE;
    }
    else if (HighValue < LowValue)
    {
        /* Error if High Threshold value is less than Low Threshold value */
        Adc_ReportDetError((uint8)ADC_CONFIGURE_THRESHOLD_ID, (uint8)ADC_E_WRONG_CONF_THRHLD_VALUE);
        bErrorFlag = (boolean)TRUE;
    }
    else
    {
      /* Check for Error: group has no channels with threshold enabled */
      /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of */
        Unit = Adc_pCfgPtr->pGroups[(GroupId)].HwUnit;
        if((uint8)STD_ON == ADC_HW_UNITS(Unit))
        {
            /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of */
            for(ChCount = 0U; ((boolean)FALSE == bThresholdEnabled) && \
                (ChCount <Adc_pCfgPtr->pGroups[GroupId].AssignedChannelCount); \
                ChCount++
               )
            {
                /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of */
                Ch = Adc_pCfgPtr->pGroups[GroupId].pAssignment[ChCount];
                /** @violates @ref Adc_c_REF_4 Array indexing shall be the only allowed form of */
                if(ADC_UNUSED_THRESHOLD_U8 != Adc_pCfgPtr->pChannels[Unit][Ch].u8ThReg)
                {
                    bThresholdEnabled = (boolean)TRUE;
                }
            }

            if ((boolean)FALSE == bThresholdEnabled)
            {
                Adc_ReportDetError((uint8)ADC_CONFIGURE_THRESHOLD_ID, (uint8)ADC_E_WRONG_CONF_THRHLD_GROUP);
                bErrorFlag = (boolean)TRUE;
            }
        }
    }

    if((boolean)FALSE == bErrorFlag)
    {
  #endif /* if (ADC_DEV_ERROR_DETECT == STD_ON) */

        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_26();
        ConThdRet = Adc_Ipw_ConfigureThreshold(GroupId, LowValue, HighValue);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_26();

