marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(ADC_CTUV2_EN_DIS_TRG_HANDLER_CTRL_REGS_ID, u8Trigger);
    if((Std_ReturnType)E_OK == Ret)
#endif
    {
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_28();
        Ret = Adc_Ipw_Ctu2TriggerHandlerCtrlRegsEnableDisable(u8Trigger, bEnable);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_28();
    }
    return Ret;
}

/**
* @brief   Function to set the cmd list handler control registers of the CTUV2 IP.
 *
 * @details Full configurability of CLCR1 & CLCR2 registers of the CTUv2 IP.
 *          This function has in input the CTU trigger (0...7) and  the position of the first
 *          command in the command list.
 *          See from the RM the CLCR1 and CLCR2 registers for the right API use.
 *
 * @param[in]  u8Trigger      Index of the trigger: 0...7.
 * @param[in]  u8ClcrValue   Position of the first command
 *
 * @note    The function Service ID[hex]: 0x37.
 *
 * @return         Std_ReturnType  E_OK or E_NOT_OK.
 * @retval         E_OK            In case of successful settings.
 * @retval         E_NOT_OK        In case of unsuccessful settings.
 *
 * @implements Adc_SetCTU2CmdListHandlerCtrlRegs_Activity
 *
 * @api
 */
/** @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
 * functions at file scope shall have internal linkage unless external linkage is required
 * @violates @ref Adc_c_REF_5 Identifier clash
 */
FUNC(Std_ReturnType, ADC_CODE) Adc_SetCtu2CmdListHandlerCtrlRegs
(
    VAR(uint8, AUTOMATIC) u8Trigger,
    VAR(uint8, AUTOMATIC) u8ClcrValue
)
{
    VAR(Std_ReturnType, AUTOMATIC) Ret = (Std_ReturnType)E_OK;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(ADC_CTUV2_SET_CMD_LIST_HANDLER_CTRL_REGS_ID, u8Trigger);
    if((Std_ReturnType)E_OK == Ret)
    {
        if ((uint32)u8ClcrValue > CTU2_CLCR_MAX_VALUE_U8)
        {
            Adc_ReportDetError(ADC_CTUV2_SET_CMD_LIST_HANDLER_CTRL_REGS_ID, ADC_E_WRONG_CTUV2_CLCR_TRIGGER);
            Ret = (Std_ReturnType)E_NOT_OK;
        }
    }
    if((Std_ReturnType)E_OK == Ret)
#endif
    {
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_28();
        Ret = Adc_Ipw_SetCtu2CmdListHandlerCtrlRegs(u8Trigger, u8ClcrValue);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_28();
    }
    return Ret;
}
/**
 * @brief   Function to set the trigger compare registers of the CTUV2 IP.
 *
 * @details Full configurability of CTU TxCR registers of the CTUv2 IP.
 *          This function has in input the CTU trigger (0...7) and the comparator value
 *          See from the RM the TxCR trigger compare registers for the right compare_value to use.
 *
 * @note    The function Service ID[hex]: 0x38.
 *
 * @param[in]  u8Trigger      Index of the trigger: 0...7.
 * @param[in]  u16CompareValue  value to set in the register TxCR.
 *
 * @return         Std_ReturnType  E_OK or E_NOT_OK.
 * @retval         E_OK            In case of successful settings.
 * @retval         E_NOT_OK        In case of unsuccessful settings.
 *
 * @implements Adc_SetCTU2TriggerCompareRegs_Activity
 *
 * @api
 */
 /** @violates @ref Adc_c_REF_3 All declarations and definitions of objects or
* functions at file scope shall have internal linkage unless external linkage is required */
FUNC(Std_ReturnType, ADC_CODE) Adc_SetCtu2TriggerCompareRegs
(
    VAR(uint8, AUTOMATIC) u8Trigger,
    VAR(uint16, AUTOMATIC) u16CompareValue
)
{
    VAR(Std_ReturnType, AUTOMATIC) Ret = (Std_ReturnType)E_OK;

#if (ADC_DEV_ERROR_DETECT == STD_ON)
    Ret = Adc_ValidateCallAndTrigger(ADC_CTUV2_SET_TRIGGER_COMPARE_REGS_ID, u8Trigger);
    if((Std_ReturnType)E_OK == Ret)
#endif
    {
        SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_28();
        Ret = Adc_Ipw_SetCtu2TriggerCompareRegs(u8Trigger, u16CompareValue);
        SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_28();
    }
    return Ret;
}
#endif /* if (ADC_CTUV2_ENABLE_TRIGGER_CONFIGURATION_APIS == STD_ON)  */

#if (ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON)
#if (ADC_DEV_ERROR_DETECT == STD_ON)
/**
* @brief        This function validates the Adc unit is activated for Ctu control mode.
* @details      This service is a non reentrant function used for validating the Adc unit when
*               Ctu control mode is used.
*
* @param[in]    Unit            The unit id
*
* @return       Std_ReturnType  Standard return type.
* @retval       E_OK:           The call is valid
* @retval       E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateUnitActive
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(Std_ReturnType, AUTOMATIC) Return = (Std_ReturnType)E_OK;

    if ((uint8)STD_OFF == Adc_pCfgPtr->pCtuCfgPtr->au8AdcUnitActive[Unit])
    {
        Adc_ReportDetError(u8ServiceId, (uint8)ADC_E_PARAM_UNIT);
        Return = (Std_ReturnType)E_NOT_OK;
    }

    return Return;
}

/**
* @brief        This function validates the state of s unit when the Ctu Control is enabled.
* @details      This service is a non reentrant function used for validating the state of a unit
*               when the ctu control is enabled.
*
* @param[in]    Unit            The unit id
*
* @return       Std_ReturnType  Standard return type.
* @retval       E_OK:           The call is valid
* @retval       E_NOT_OK:       The call is not valid
*/
LOCAL_INLINE FUNC(Std_ReturnType, ADC_CODE) Adc_ValidateStateCtuControlMode
(
    VAR(uint8, AUTOMATIC) u8ServiceId,
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
    VAR(Std_ReturnType, AUTOMATIC) ValidState = (Std_ReturnType)E_OK;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwNormalQueue = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInSwInjectedQueue = 0U;
#if (ADC_HW_TRIGGER_API == STD_ON)
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInHwNormalQueue = 0U;
    VAR(Adc_QueueIndexType, AUTOMATIC) NoGroupsInHwInjectedQueue = 0U;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

    switch(u8ServiceId)
    {
        case ADC_ENABLECTUCONTROLMODE_ID:
        {
            /* Enter critical section to protect against queue modifications */
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_29();
            /* Get HW and SW queue sizes */
            NoGroupsInSwNormalQueue = Adc_aUnitStatus[Unit].SwNormalQueueIndex;
            NoGroupsInSwInjectedQueue = Adc_aUnitStatus[Unit].SwInjectedQueueIndex;
#if (ADC_HW_TRIGGER_API == STD_ON)
            NoGroupsInHwNormalQueue = Adc_aUnitStatus[Unit].HwNormalQueueIndex;
            NoGroupsInHwInjectedQueue = Adc_aUnitStatus[Unit].HwInjectedQueueIndex;
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */

            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_29();

