marshallma21/AUTOSAR_SampleProject_MPC5748G/plugins/Adc_TS_T2D35M10I0R0/src/Adc.c
            /* Check for ongoing conversions */
            if ((NoGroupsInSwNormalQueue != (Adc_QueueIndexType)0) ||
                (NoGroupsInSwInjectedQueue != (Adc_QueueIndexType)0) ||
#if (ADC_HW_TRIGGER_API == STD_ON)
                (NoGroupsInHwInjectedQueue != (Adc_QueueIndexType)0) ||
                (NoGroupsInHwNormalQueue != (Adc_QueueIndexType)0) ||
#endif /* (ADC_HW_TRIGGER_API == STD_ON) */
                ((boolean)TRUE == Adc_aUnitStatus[Unit].bCtuControlOngoing)
               )
            {
                ValidState = (Std_ReturnType)E_NOT_OK;
                Adc_ReportDetError((uint8)ADC_ENABLECTUCONTROLMODE_ID, (uint8)ADC_E_BUSY);
            }
            break;
        }
        case ADC_DISABLECTUCONTROLMODE_ID:
        {
            /* Ctu control mode is not already enabled for this unit */
            if((boolean)FALSE == Adc_aUnitStatus[Unit].bCtuControlOngoing)
            {
                ValidState = (Std_ReturnType)E_NOT_OK;
                Adc_ReportDetError((uint8)ADC_DISABLECTUCONTROLMODE_ID, (uint8)ADC_E_IDLE);
            }
            break;
        }
        default:
        {
            break;
        }
    }
    return ValidState;
}
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */

/**
 * @brief   Function to enable CTU control mode for an ADC unit.
 *
 * @details Enable CTU control mode for an ADC unit.
 *          This function to enable CTU control mode for Adc. When a unit works in CTU control mode,
 *          no other conversions shall run in parallel(Adc). The only conversions occurring shall be
 *          the ones defined in the CTU configuration.
 *
 * @param[in]  Unit      ADC Unit Id.
 *
 * @note    The function Service ID[hex]: 0x39.
 *
 * @implements Adc_EnableCtuControlMode_Activity
 *
 * @api
 */
/** @violates @ref Adc_c_REF_3 internal linkage vs external linkage. */
FUNC(void, ADC_CODE) Adc_EnableCtuControlMode
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_ENABLECTUCONTROLMODE_ID, Unit))
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    {
        if ((Std_ReturnType)E_OK == Adc_ValidateUnitActive(ADC_ENABLECTUCONTROLMODE_ID, Unit))
        {
            if ((Std_ReturnType)E_OK == Adc_ValidateStateCtuControlMode(ADC_ENABLECTUCONTROLMODE_ID, Unit))
            {
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
                Adc_Ipw_EnableCtuControlMode(Unit);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
            }
        }
    }
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
}
/**
 * @brief   Function to disable CTU control mode for an ADC unit.
 *
 * @details Disable CTU control mode for an ADC unit.
 *          This function to disable CTU control mode for Adc. The other Adc conversions can run in
 *          software trigger normal mode, software trigger injected mode or hardware trigger mode.
 *
 * @param[in]  Unit      ADC Unit Id.
 *
 * @note    The function Service ID[hex]: 0x4A.
 *
 * @implements Adc_DisableCtuControlMode_Activity
 *
 * @api
 */
/** @violates @ref Adc_c_REF_3 internal linkage vs external linkage. */
FUNC(void, ADC_CODE) Adc_DisableCtuControlMode
(
    VAR(Adc_HwUnitType, AUTOMATIC) Unit
)
{
#if (ADC_VALIDATE_CALL_AND_UNIT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndUnit(ADC_DISABLECTUCONTROLMODE_ID, Unit))
#endif /* ADC_VALIDATE_CALL_AND_UNIT == STD_ON */
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    {
        if ((Std_ReturnType)E_OK == Adc_ValidateUnitActive(ADC_DISABLECTUCONTROLMODE_ID, Unit))
        {
            if ((Std_ReturnType)E_OK == Adc_ValidateStateCtuControlMode(ADC_DISABLECTUCONTROLMODE_ID, Unit))
            {
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
                Adc_Ipw_DisableCtuControlMode(Unit);
#if (ADC_DEV_ERROR_DETECT == STD_ON)
            }
        }
    }
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
}
#endif /* ADC_ENABLE_CTU_CONTROL_MODE_API == STD_ON */

#if (ADC_SETCHANNEL_API == STD_ON)
/**
 * @brief   Function to dynamic handling of ADC channels list for Adc channel group.
 *
 * @details Dynamic handling of ADC channels list.
 *          This function to dynamic handling of ADC channels list for Adc channel group.
 *
 * @param[in]  Group                Group Id.
 * @param[in]  pChannel             Pointer to channel list array.
 * @param[in]  NumberOfChannel      Number of Channel.
 *
 * @note    The function Service ID[hex]: 0x4B.
 *
 * @implements Adc_SetChannel_Activity
 *
 * @api
 * @violates @ref Adc_c_REF_3 internal linkage vs external linkage.
 */
FUNC(void, ADC_CODE) Adc_SetChannel
(
    CONST(Adc_GroupType, AUTOMATIC) Group,
    P2CONST(Adc_GroupDefType, AUTOMATIC, ADC_APPL_CONST) pChannel,
    P2CONST(uint16, AUTOMATIC, ADC_APPL_CONST) pDelays,
    CONST(uint16, AUTOMATIC) u16Mask,
    CONST(Adc_ChannelIndexType, AUTOMATIC) NumberOfChannel
)
{
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    if ((Std_ReturnType)E_OK == Adc_ValidateCallAndGroup(ADC_SETCHANNEL_ID, Group))
    {
    #ifdef ADC_PDB_SUPPORTED
        if((NULL_PTR == pChannel) || (NULL_PTR == pDelays))
    #else
        if(NULL_PTR == pChannel)
    #endif /* ADC_PDB_SUPPORTED */       
        {
            Adc_ReportDetError(ADC_SETCHANNEL_ID, (uint8)ADC_E_PARAM_POINTER);
        }
        else if(0U == NumberOfChannel)
        {
            Adc_ReportDetError(ADC_SETCHANNEL_ID, (uint8)ADC_E_PARAM_CHANNEL);
        }
        else
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
        {
            /* Enter critical region */
            SchM_Enter_Adc_ADC_EXCLUSIVE_AREA_30();
            Adc_aRuntimeGroupChannel[Group].pChannel = pChannel;
        #ifdef ADC_PDB_SUPPORTED
            Adc_aRuntimeGroupChannel[Group].pu16Delays = pDelays;
            Adc_aRuntimeGroupChannel[Group].u16Mask = u16Mask;
        #endif /* ADC_PDB_SUPPORTED */
            Adc_aRuntimeGroupChannel[Group].ChannelCount = NumberOfChannel;
            Adc_aRuntimeGroupChannel[Group].bRuntimeUpdated = (boolean) TRUE;
            /* Exit critical region */
            SchM_Exit_Adc_ADC_EXCLUSIVE_AREA_30();
        }
#if (ADC_DEV_ERROR_DETECT == STD_ON)
    }
#endif /* ADC_DEV_ERROR_DETECT == STD_ON */
}
#endif /* ADC_SETCHANNEL_API == STD_ON */

